       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG01001.
      *  Primer Programa de Prueba
      *  Campero Granados Luis Daniel
      *  21 ABR 24
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       010-INICIO.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM PRG01001.
